<template>
    <div class="about-me-container">
      <header>
          <HomeHeader></HomeHeader>  
      </header>
      <main>
        <div class="about-me-main-container">
            <div class="about-me-text">
              <p>Всех приветствую! Я хотел бы представить вам мой первый pet-проект — поиск фильмов в фильмотеке. Хотя это не окончательная версия и многие вещи ещё нуждаются в отладке и дополнении, я хотел бы поделиться с вами текущими результатами.</p>
              <p>Основная цель этого проекта — создать инструмент, который позволит пользователям находить фильмы в фильмотеке. Моя задача состояла в разработке функционала поиска и возможности перехода на сторонние ресурсы для получения дополнительной информации о фильмах. Хочу отметить, что в проекте могут быть как ошибки в логике и оформлении, так и проблемы с вёрсткой. Однако, стоит помнить, что это исключительно учебный проект, на котором я тренируюсь и экспериментирую с новыми идеями.</p>
              <p> Я стремлюсь улучшить проект по мере развития моих навыков и получения обратной связи от пользователей. Я всегда открыт к предложениям и идеям по улучшению функционала и исправлению ошибок. Спасибо, что решили заглянуть в мой проект! Я надеюсь, что вам понравится и найдёте полезную информацию о фильмах в фильмотеке.</p> 
            </div>
            <div class="about-me-contact">
             <a href="https://telegram.me/mlsrg"><img src="../../assets/images/about/tg.png" alt=""></a>
             <a href="mailto:molokov0102@gmail.com"><img src="../../assets/images/about/gmail.png" alt=""></a>
             <a href="https://vk.com/molsrg"><img src="../../assets/images/about/vk.png" alt=""></a>
            </div>
        </div>
      </main>
    </div>
  </template>
  
  <script>
  import HomeHeader from '../Home/HomeHeader.vue'
  export default {
      components: {
        HomeHeader
      }, 
  }
  </script>
  
